app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "A comment."], ["post_id", 1], ["created_at", "2018-06-14 18:42:48.614447"], ["updated_at", "2018-06-14 18:42:48.614447"]]
---
  def create
    @comment = @post.comments.build(comments_params)
    if @comment.save